Sujay-Golla/koganeee/firmware/companion-esp32s3/sdkconfig.defaults
# KOGANE companion defaults (esp32s3, WROOM-1-N16R8)
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESP32S3_SPIRAM_SUPPORT=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_TASK_WDT_EN=y
# Wi-Fi
CONFIG_ESP_WIFI_ENABLED=y
# Larger main task stack for bring-up logging
CONFIG_ESP_MAIN_TASK_STACK_SIZE=6144
